stm32-hotspot/Nucleo_WB55RG_Zigbee_OTA_TransferResume/STM32_WPAN/App/app_zigbee.c
  return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  OTA client Query Next Image callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  status: ZCL status code returned by the server for the requested image
 * @param  image_definition: Image query definition pointer
 * @param  image_size: OTA file format image total size
 * @param  arg: Passed arg
 * @retval ZCL status code
 */
static void APP_ZIGBEE_OTA_Client_QueryNextImage_cb(struct ZbZclClusterT *clusterPtr, enum ZclStatusCodeT status,
                                                    struct ZbZclOtaImageDefinition *image_definition, uint32_t image_size, void *arg){
  struct Zigbee_OTA_client_info* client_info = (struct Zigbee_OTA_client_info*) arg;
  bool ota_resume_status = false;
  APP_DBG("[OTA] Client Query Next Image request response received.");
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("[OTA] A such image is not available.\n");
    return;
  } else {
    APP_DBG("[OTA] A such image is available.");
  }

  switch(image_definition->image_type){
    case fileType_COPRO_WIRELESS:
      client_info->ctx.base_address = FUOTA_COPRO_FW_BINARY_ADDRESS;
      client_info->ctx.magic_keyword = FUOTA_MAGIC_KEYWORD_COPRO_WIRELESS;
      client_info->ctx.file_type = fileType_COPRO_WIRELESS;
      break;

    case fileType_APP:
      client_info->ctx.base_address = FUOTA_APP_FW_BINARY_ADDRESS;
      client_info->ctx.magic_keyword = FUOTA_MAGIC_KEYWORD_APP;
      client_info->ctx.file_type = fileType_APP;
      break;

    default:
      APP_DBG("[OTA] Error, unknown image type.\n");
      return;
  }
  client_info->requested_image_size = image_size;
  client_info->ctx.binary_srv_crc = 0;
  client_info->ctx.binary_calc_crc = 0;
  client_info->ctx.file_version = image_definition->file_version;
  if(APP_ZIGBEE_CheckDeviceCapabilities() != APP_ZIGBEE_OK){
    APP_DBG("[OTA] Not enough space. No download.\n");
    return;
  }

/* Check if we have previous downloaded data */
if(client_info->flags & OTA_CLIENT_CTX_FOUND_FLAG)
{
  /* Check and validate previous OTA data in flash (in case we resume a transfer) */
  /* Validate date against received header */
  ota_resume_status = APP_ZIGBEE_OTA_Client_CheckPriviousDownload(image_definition);
  if(ota_resume_status)
  {
    /* Checks are ok , we can resume download */
    client_info->flags |= OTA_CLIENT_RESUME_DOWNLOAD_FLAG;
    APP_DBG("[OTA] Resuming download for this image type.\n");
  }
  else
  {
    /* Image type header mismatch previous data in NVM , clean up to start a fresh download */
    client_info->flags &= ~OTA_CLIENT_CTX_FOUND_FLAG;
    APP_DBG("Delete_Sectors");
    Delete_Sectors();
    APP_DBG("[OTA] checks failled , starting a fresh download.\n");
    
  }
}
if(client_info->flags & OTA_CLIENT_RESUME_DOWNLOAD_FLAG){
  /* Check previous ota state machine */
  if(client_info->zigbee_ota_ctx_nvm.OtaCurrentState == DOWNLOADING_IMAGE)
  {
    /* Continue downloading */
  }
  if(client_info->zigbee_ota_ctx_nvm.OtaCurrentState == VERIFYING_IMAGE)
  {
    static enum ZclStatusCodeT  ret_val;
    /* Jump to verification stage */
    ret_val = APP_ZIGBEE_OTA_Client_ImageValidate_cb(NULL,NULL,client_info);
    if(ret_val == ZCL_STATUS_SUCCESS)
    {
      /* Schedule reboot if validation is ok */
      APP_DBG("**************************************************************");
      APP_DBG("[OTA] Rebooting.");
      HAL_Delay(100);
      UTIL_SEQ_SetTask(1U << (uint32_t)CFG_TASK_FUOTA_RESET, CFG_SCH_PRIO_0);
      return;
    }
  }
}
  client_info->OTA_state = DOWNLOADING_IMAGE;
  APP_DBG("[OTA] For image type 0x%04x, %d byte(s) will be downloaded.", image_definition->image_type, image_size);
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_OTA_START_DOWNLOAD, CFG_SCH_PRIO_0);
  APP_DBG("[OTA] Starting download.\n");
}


/**
 * @brief  OTA client Calc CRC for a payload
 * @param  data: payload to calc
 * @param  size: length of payload
 */
static void APP_ZIGBEE_OTA_Client_Crc_Calc( struct Zigbee_OTA_client_info * client_info ) {
  uint8_t     modulo;
  uint16_t    index, size;
  uint32_t *  crc_data;

  // -- Prepare pointer & size --
  size = client_info->write_info.firmware_buffer_current_offset;
  crc_data = (uint32_t *)client_info->write_info.firmware_buffer;
  modulo = size % 4u;
  if ( modulo != 0u )
  {
      memset( &crc_data[size], 0, ( 4u - modulo ) );
      size  += ( 4u - modulo );
  }

  for ( index = 0; index < ( size / 4u ); index++ )
  {
    client_info->ctx.binary_calc_crc ^= crc_data[index];
  }
}


/**
 * @brief  OTA client Write Image callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  header: ZCL OTA file format image header
 * @param  length: received chunk length
 * @param  data: received chunk payload
 * @param  arg: Passed arg
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Client_WriteImage_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclOtaHeader *header,
                                                               uint8_t length, uint8_t * data, void *arg){
  static uint32_t current_offset = 0;

  struct Zigbee_OTA_client_info* client_info = (struct Zigbee_OTA_client_info*) arg;
  enum ZclStatusCodeT status = ZCL_STATUS_SUCCESS;
  uint8_t size = 0;
  uint8_t remaining_size = 0;
#ifdef OTA_DISPLAY_TIMING
  static uint32_t  lStartTime = 0;
  uint32_t  lStopTime, lTime1, lTime2;
#endif // OTA_DISPLAY_TIMING
  current_offset += length;
  size = length;
  /* Check if we can resume previous download (if any) */
  if(client_info->flags & OTA_CLIENT_RESUME_DOWNLOAD_FLAG)
  {
    /* Resume OTA process from a previsouly downloaded file */
    current_offset+= client_info->zigbee_ota_ctx_nvm.flash_offset;
    /* reset flag */
    client_info->flags &= ~OTA_CLIENT_RESUME_DOWNLOAD_FLAG;
    /* Update ota cluster ZCL_OTA_ATTR_FILE_OFFSET attribute, need to skip header length (which is sent with every block response ) + TAG length */
    if(ZbZclAttrIntegerWrite(zigbee_app_info.ota_client,ZCL_OTA_ATTR_FILE_OFFSET,client_info->zigbee_ota_ctx_nvm.flash_offset+header->header_length+OTA_HEADER_TAG_SIZE  ) != ZCL_STATUS_SUCCESS)
    {
      APP_DBG("[OTA] FUOTA failed to update ota cluster attr with value offset= 0x%04X)", current_offset);
      return ZCL_STATUS_FAILURE;
    }

    APP_DBG("[OTA] FUOTA Transfer resuming from NVM ( offset= 0x%04X)", current_offset);
    return status;
  }
  if(client_info->write_info.firmware_buffer_current_offset + size > RAM_FIRMWARE_BUFFER_SIZE)
  {
    size = RAM_FIRMWARE_BUFFER_SIZE - client_info->write_info.firmware_buffer_current_offset;
    remaining_size = length - size;
    client_info->write_info.buffer_full = true;
  } else if(client_info->write_info.firmware_buffer_current_offset+size == RAM_FIRMWARE_BUFFER_SIZE){
    client_info->write_info.buffer_full = true;
  }

  memcpy((client_info->write_info.firmware_buffer+client_info->write_info.firmware_buffer_current_offset), data, size);
  client_info->write_info.firmware_buffer_current_offset += size;

  if(client_info->write_info.buffer_full){
#ifdef OTA_DISPLAY_TIMING
    lStopTime = HAL_GetTick();
#endif // OTA_DISPLAY_TIMING

    /* Write to Flash Memory */
    if ( APP_ZIGBEE_OTA_Client_WriteFirmwareData(client_info) != APP_ZIGBEE_OK ){
      return ZCL_STATUS_FAILURE;
    }

