stm32-hotspot/Nucleo_WB55RG_Zigbee_OTA_TransferResume/STM32_WPAN/App/app_zigbee.c
#ifdef OTA_DISPLAY_TIMING
    /* Display Transfer Progress */
    lTime1 = lStopTime - lStartTime;
    lTime2 = ( HAL_GetTick() - lStopTime );
    APP_DBG("[OTA] FUOTA Transfer (current_offset = 0x%04X, load time = %d ms and save time = %d ms)", current_offset, lTime1, lTime2);
#else // OTA_DISPLAY_TIMING
    APP_DBG("[OTA] FUOTA Transfer (current_offset = 0x%04X)", current_offset);
#endif // OTA_DISPLAY_TIMING

    // -- Calc CRC --
    APP_ZIGBEE_OTA_Client_Crc_Calc( client_info );

    memset(client_info->write_info.firmware_buffer, 0, RAM_FIRMWARE_BUFFER_SIZE);
    memcpy(client_info->write_info.firmware_buffer, data+size, remaining_size);
    client_info->write_info.firmware_buffer_current_offset = remaining_size;
    client_info->write_info.buffer_full = false;

#ifdef OTA_DISPLAY_TIMING
    lStartTime = HAL_GetTick();
#endif // OTA_DISPLAY_TIMING
  }

  /* Handling donwload pause request */
  if(client_info->flags & OTA_CLIENT_PAUSE_DOWNLOAD_FLAG )
  {
    /* reset flag */
    client_info->flags &= ~OTA_CLIENT_PAUSE_DOWNLOAD_FLAG;
    /* Wait before requesting the next block. */
    return ZCL_STATUS_WAIT_FOR_DATA;
  }

  return status;
}


#ifdef USE_TAG_WRITE_CB
/**
* @brief  OTA client WriteTag callback
* @param  clusterPtr: ZCL Cluster pointer
* @param  header: ZCL OTA file format image header
* @param  tag_id: Tag identifier
* @param  tag_length : length of Tag
* @param  data_length  : length of Tag data
* @param  data  : Tag data
* @param  arg: Passed arg
* @retval ZCL status code
*/
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Client_WriteTag_cb(struct ZbZclClusterT * clusterPtr, struct ZbZclOtaHeader * header,
                                                            uint16_t tag_id, uint32_t tag_length, uint8_t data_length,
                                                            uint8_t * data, void * arg)
{
   struct Zigbee_OTA_client_info* client_info = (struct Zigbee_OTA_client_info*) arg;
   enum ZclStatusCodeT status = ZCL_STATUS_SUCCESS;
   UNUSED(tag_length);

   switch (tag_id)
   {
       case ZCL_OTA_SUB_TAG_UPGRADE_IMAGE:
           /* APP_DBG("[OTA] Writing blocks. \n"); */
           status = APP_ZIGBEE_OTA_Client_WriteImage_cb(clusterPtr, header, data_length, data, arg);
           break;

       case ZCL_OTA_SUB_TAG_IMAGE_INTEGRITY_CODE:
           APP_DBG("[OTA] Get check crc. \n");
           client_info->ctx.binary_srv_crc = (uint32_t)data[0] | ( (uint16_t)data[1] << 8 );
           if ( data_length == 4u )
           {
             client_info->ctx.binary_srv_crc |= ( (uint32_t)data[2] << 16u ) | ( (uint32_t)data[3] << 24u );
           }
           break;

       default:
           status = ZCL_STATUS_INVALID_FIELD;
           break;
   }
   return status;
}
#endif

/**
 * @brief  OTA client Image Validate callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  header: ZCL OTA file format image header
 * @param  arg: Passed arg
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Client_ImageValidate_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclOtaHeader *header, void *arg){
  struct Zigbee_OTA_client_info* client_info = (struct Zigbee_OTA_client_info*) arg;
  enum ZclStatusCodeT status = ZCL_STATUS_SUCCESS;
  uint64_t last_double_word = 0;
  double l_transfer_throughput = 0;
  uint32_t lTransfertThroughputInt, lTransfertThroughputDec;

  /* Download finished => stop Toggling of the LED */
  HW_TS_Stop(TS_ID_LED);
  BSP_LED_Off(LED_GREEN);
  APP_DBG("LED_GREEN OFF");
  client_info->OTA_state=VERIFYING_IMAGE;
  /* Write the last RAM buffer to Flash */
  if(client_info->write_info.firmware_buffer_current_offset != 0){
    /* Write to Flash Memory */
    APP_ZIGBEE_OTA_Client_WriteFirmwareData(client_info);
    client_info->write_info.firmware_buffer_current_offset = 0;
  }

  APP_DBG("**************************************************************\n");
  APP_DBG("[OTA] Validating the image.");
  
  /* Finding the magic number */

  /* Last double word in Flash
   * => the magic if the firmware is valid
   */
  client_info->write_info.flash_current_offset -= 8;
  memcpy(&last_double_word, (void const*)(client_info->ctx.base_address + client_info->write_info.flash_current_offset), 8);
  if(((last_double_word & 0x00000000FFFFFFFF) != client_info->ctx.magic_keyword)
     && (((last_double_word & 0xFFFFFFFF00000000) >> 32) != client_info->ctx.magic_keyword)){
    APP_DBG("[OTA] Wrong magic keyword: invalid firmware.\n");
    status = ZCL_STATUS_INVALID_IMAGE;
    return status;
  }

  APP_DBG("[OTA] The downloaded firmware is valid.\n");
  client_info->download_time = (HAL_GetTick()- client_info->download_time)/1000;
  l_transfer_throughput = (((double)client_info->requested_image_size/client_info->download_time) / 1000) * 8;
  lTransfertThroughputInt = (uint32_t)l_transfer_throughput;
  lTransfertThroughputDec = (uint32_t)( ( l_transfer_throughput - lTransfertThroughputInt ) * 100 );

  APP_DBG("**************************************************************");
  APP_DBG(" FUOTA : END OF TRANSFER COMPLETED");

  if(client_info->image_type == IMAGE_TYPE_FW_COPRO_WIRELESS){
    APP_DBG("  - M0 wireless coprocessor firmware.");
  } else {
    APP_DBG("  - M4 application firmware.");
  }

  APP_DBG("  - %d bytes downloaded in %d seconds.",  client_info->requested_image_size, client_info->download_time);
  APP_DBG("  - Average throughput = %d.%d kbit/s.", lTransfertThroughputInt, lTransfertThroughputDec );
  APP_DBG("**************************************************************");

  BSP_LED_On(LED_GREEN);
  APP_DBG("LED_GREEN ON");

  return status;
}

/**
 * @brief  OTA client Reboot callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  arg: Passed arg
 * @retval None
 */
static void APP_ZIGBEE_OTA_Client_Reboot_cb(struct ZbZclClusterT *clusterPtr, void *arg){
  UNUSED(arg);

  APP_DBG("**************************************************************");
  APP_DBG("[OTA] Rebooting.");

  APP_DBG("LED_BLUE OFF");
  BSP_LED_Off(LED_BLUE);
  APP_DBG("LED_GREEN OFF");
  BSP_LED_Off(LED_GREEN);
  APP_DBG("**************************************************************\n");
  
