stm32-hotspot/Nucleo_WB55RG_Zigbee_OTA_TransferResume/STM32_WPAN/App/app_zigbee.c
  HAL_Delay(100);
  UTIL_SEQ_SetTask(1U << (uint32_t)CFG_TASK_FUOTA_RESET, CFG_SCH_PRIO_0);
}

/**
 * @brief  OTA client Abort callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  commandId: ZCL OTA command ID associated to the block transfer abortion
 * @param  arg: Passed arg
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Client_AbortDownload_cb(struct ZbZclClusterT *clusterPtr, enum ZbZclOtaCommandId commandId, void *arg){
 
  struct Zigbee_OTA_client_info* client_info = (struct Zigbee_OTA_client_info*) arg;
  APP_DBG("[OTA] Server aborted download.");
  HW_TS_Stop(TS_ID_LED);
  BSP_LED_Off(LED_GREEN);
  BSP_LED_On(LED_RED);

//  if(commandId == ZCL_OTA_COMMAND_IMAGE_BLOCK_RESPONSE)
//  {
  #ifdef OTA_ABORT_RETRY_ENABLE
    client_info->OTA_abort_retries++;
    if(client_info->OTA_abort_retries < OTA_CLIENT_ABORT_MAX_RETRIES )
    {
      APP_DBG("[OTA] retrying resume download in 500ms");
      HW_TS_Start(TS_DOWNLOAD_RESUME, (uint32_t)OTA_DOWNLOAD_RETRY_DELAY);
    }
    else
    {
      
      APP_DBG("[OTA] FATAL ERROR :resuming download failled after %d attempts",client_info->OTA_abort_retries);
      client_info->OTA_abort_retries=0;
      return ZCL_STATUS_SUCCESS;
    }
  #endif
 //}

  return ZCL_STATUS_ABORT;
}

/**
 * @brief  OTA client request upgrade
 * @param  None
 * @retval None
 */
static inline void APP_ZIGBEE_OTA_Client_Request_Upgrade(void){
  enum ZclStatusCodeT status;
  struct ZbZclOtaImageDefinition image_definition;

  APP_DBG("[OTA] Requesting an update.");
  APP_DBG("[OTA] Image type: 0x%04x.", OTA_client_info.image_type);
  APP_DBG("[OTA] Current file version: 0x%08x.\n", OTA_client_info.current_file_version);

  /* Image definition configuration */
  memset(&image_definition, 0, sizeof(image_definition));
  image_definition.manufacturer_code = ST_ZIGBEE_MANUFACTURER_CODE;
  image_definition.image_type = OTA_client_info.image_type;
  image_definition.file_version = OTA_client_info.current_file_version;

  OTA_client_info.OTA_state = QUERYING_NEXT_IMAGE;
  /* Sending Discovery request to server */
  APP_DBG("[OTA] Sending Query Next Image request.");
  /* HW version is provided as additional info in Query Next Image request */
  status = ZbZclOtaClientQueryNextImageReq(zigbee_app_info.ota_client, &image_definition,
                                           ZCL_OTA_QUERY_FIELD_CONTROL_HW_VERSION, CURRENT_HARDWARE_VERSION);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("ZbZclOtaClientDiscover failed.\n");
  }
}

/**
 * @brief  OTA client start download
 * @param  None
 * @retval None
 */
static inline void APP_ZIGBEE_OTA_Client_StartDownload(void){
  HW_TS_Start(TS_ID_LED, (uint32_t)LED_TOGGLE_TIMING);
  OTA_client_info.download_time = HAL_GetTick();
  ZbZclOtaClientImageTransferStart(zigbee_app_info.ota_client);
}

/**
 * @brief  OTA client pause download
 * @param  None
 * @retval None
 */
static inline void APP_ZIGBEE_OTA_Client_PauseDownload(void){
  /* Request download pause */
  OTA_client_info.flags |= OTA_CLIENT_PAUSE_DOWNLOAD_FLAG ;
}


/**
 * @brief  OTA client resume download
 * @param  None
 * @retval None
 */
static inline void APP_ZIGBEE_OTA_Client_ResumeDownload(void){
  /* Resume download */
  ZbZclOtaClientImageTransferResume(zigbee_app_info.ota_client);
}

/**
 * @brief  OTA client check for previous ota data vs server image_definition
 * @param  struct ZbZclOtaImageDefinition *image_definition : image type header received 
 * @retval bool : True : Resume download, False : erase sectors and start a new download
 */
static bool APP_ZIGBEE_OTA_Client_CheckPriviousDownload(struct ZbZclOtaImageDefinition *image_definition){
  /* Check previous downloaded image type & version */
  bool status = true;
  if(image_definition->file_version != OTA_client_info.zigbee_ota_ctx_nvm.file_version)
  {
    status = false;
  }

  if(image_definition->image_type != OTA_client_info.zigbee_ota_ctx_nvm.previous_image_type)
  {
    status = false;
  }

  return status;
}


/**
 * @brief  OTA Server find image type helper
 * @param  fileType: requested file type
 * @retval index value
 */
static inline int APP_ZIGBEE_FindImageType(unsigned int fileType)
{
    for(unsigned int i=0; i<(sizeof(OTA_currentFileVersionTab)/sizeof(*OTA_currentFileVersionTab)); i++)
    {
        if(OTA_currentFileVersionTab[i].fileType == fileType){ return i; }
    }
    return -1;
}

/**
 * @brief  OTA client writing firmware data from internal RAM cache to flash
 * @param  client_info: OTA client internal structure
 * @retval Application status code
 */
static inline APP_ZIGBEE_StatusTypeDef APP_ZIGBEE_OTA_Client_WriteFirmwareData(struct Zigbee_OTA_client_info* client_info){
  uint64_t l_read64 = 0;

  /* Write to Flash Memory */
  for(unsigned int flash_index = 0; flash_index < client_info->write_info.firmware_buffer_current_offset; flash_index+=8){
    while( LL_HSEM_1StepLock( HSEM, CFG_HW_FLASH_SEMID ) );
    HAL_FLASH_Unlock();
    while(LL_FLASH_IsActiveFlag_OperationSuspended());

    memcpy(&l_read64, &(client_info->write_info.firmware_buffer[flash_index]), 8);
    if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD,
        client_info->ctx.base_address + client_info->write_info.flash_current_offset,
        l_read64) == HAL_OK)
    {
      /* Read back value for verification */
      l_read64 = 0;
      l_read64 = *(uint64_t*)(client_info->ctx.base_address + client_info->write_info.flash_current_offset);
      if(l_read64 != (*(uint64_t*)(client_info->write_info.firmware_buffer+flash_index)))
      {
        APP_DBG("FLASH: Comparison failed l_read64 = 0x%jx / ram_array = 0x%jx",
                l_read64, client_info->write_info.firmware_buffer[flash_index]);
        return APP_ZIGBEE_ERROR;
      }
    }
    else
    {
      APP_DBG("HAL_FLASH_Program FAILED at flash_index = %d ,  flash offset = 0x%04X", flash_index, client_info->write_info.flash_current_offset);
      return APP_ZIGBEE_ERROR;
    }


    client_info->write_info.flash_current_offset += sizeof(uint64_t);

 
