stm32-hotspot/Nucleo_WB55RG_Zigbee_OTA_TransferResume/STM32_WPAN/App/app_zigbee.c
#ifdef OTA_DISPLAY_TIMING
  lTime2 = ( HAL_GetTick() - lPersistentStartTime );
  lPersistentStartTime = HAL_GetTick();
  APP_DBG("Persistent Data: Interval Time : %d ms and Save Time : %d ms", lTime1, lTime2);
#endif // OTA_DISPLAY_TIMING
}

/**
 * @brief  Start Zigbee Network from persistent data
 * @param  zb: Zigbee device object pointer
 * @retval Zigbee stack Status code
 */
static enum ZbStatusCodeT APP_ZIGBEE_ZbStartupPersist(struct ZigBeeT* zb)
{
   bool read_status;
   enum ZbStatusCodeT status = ZB_STATUS_SUCCESS;

   /* Restore persistence */
   read_status = APP_ZIGBEE_persist_load();

   if (read_status)
   {
       /* Make sure the EPID is cleared, before we are allowed to restore persistence */
       uint64_t epid = 0U;
       ZbNwkSet(zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid, sizeof(uint64_t));

       /* Start-up from persistence */
       APP_DBG("APP_ZIGBEE_ZbStartupPersist: restoring stack persistence");
       status = ZbStartupPersist(zb, &cache_persistent_data.U8_data[ST_PERSIST_FLASH_DATA_OFFSET], cache_persistent_data.U32_data[0],NULL, NULL, NULL);
       if (status == ZB_STATUS_SUCCESS)
       {
         bPersistDataUsed = TRUE;
       }
   }
   else
   {
       /* Failed to restart from persistence */
       APP_DBG("APP_ZIGBEE_ZbStartupPersist: no persistence data to restore");
       status = ZB_STATUS_ALLOC_FAIL;
   }

   /* Only for debug purpose, depending of persistent data, following traces
      could display bytes that are irrelevants to on off cluster */
   if (status == ZB_STATUS_SUCCESS)
   {
      /* read the last bytes of data where the ZCL on off persistent data shall be*/
      uint32_t len = cache_persistent_data.U32_data[0] + 4 ;
      APP_DBG("ClusterID %02x %02x",cache_persistent_data.U8_data[len-9],cache_persistent_data.U8_data[len-10]);
      APP_DBG("Endpoint %02x %02x",cache_persistent_data.U8_data[len-7],cache_persistent_data.U8_data[len-8]);
      APP_DBG("Direction %02x",cache_persistent_data.U8_data[len-6]);
      APP_DBG("AttrID %02x %02x",cache_persistent_data.U8_data[len-4],cache_persistent_data.U8_data[len-5]);
      APP_DBG("Len %02x %02x",cache_persistent_data.U8_data[len-2],cache_persistent_data.U8_data[len-3]);
      APP_DBG("Value %02x",cache_persistent_data.U8_data[len-1]);
   }

   return status;
}/* APP_ZIGBEE_ZbStartupPersist */

/**
 * @brief  timer callback to wait end of restore cluster persistence form M0
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PersistCompleted_callback(void)
{
  /* No cluster attributes to restore */
}/* APP_ZIGBEE_PersistCompleted_callback */


/**
 * @brief  save OTA ctx persistent data
 * @param  None
 * @retval true if success, false if fail
 */
static bool APP_ZIGBEE_OTA_ctx_save_nvm (struct Zigbee_OTA_client_info* client_info) {

  int ee_status = 0;
  uint32_t*  p_data;
  /* Populate data struct */
  client_info->zigbee_ota_ctx_nvm.flash_offset = client_info->write_info.flash_current_offset;
  client_info->zigbee_ota_ctx_nvm.previous_image_type = client_info->ctx.file_type;
  client_info->zigbee_ota_ctx_nvm.file_version = client_info->ctx.file_version;
  client_info->zigbee_ota_ctx_nvm.OtaCurrentState= client_info->OTA_state;

  p_data = (uint32_t *)&client_info->zigbee_ota_ctx_nvm.flash_offset;
 /* loop i = number of uint32_t in zigbee_ota_ctx_nvm*/ 
  for(uint8_t i =0; i< (sizeof(client_info->zigbee_ota_ctx_nvm)/sizeof(uint32_t));i++)
  {
    ee_status = EE_Write(0, USER_DB_START_ADDR+i, *(p_data+i));
    if (ee_status != EE_OK)
    {
      if (ee_status == EE_CLEAN_NEEDED) /* Shall not be there if CFG_EE_AUTO_CLEAN = 1*/
      {
        APP_DBG("CLEAN NEEDED, CLEANING");
        EE_Clean(0,0);
      }
      else
      {
        /* Failed to write , an Erase shall be done */
        APP_DBG("APP_ZIGBEE_NVM_Write failed @ %d status %d", i, ee_status);
        return false;
      }
    }
  }


  return true;

}

/**
 * @brief  load OTA ctx persistent data
 * @param  None
 * @retval true if success, false if fail
 */
static bool APP_ZIGBEE_OTA_ctx_load_nvm () {
  bool status = true;
  int ee_status = 0;
  uint32_t*  p_data;

  HAL_FLASH_Unlock();
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_PGSERR | FLASH_FLAG_WRPERR | FLASH_FLAG_OPTVERR);

  /* Searching for previous OTA CTX */
  p_data = (uint32_t *)&OTA_client_info.zigbee_ota_ctx_nvm.flash_offset;
  for(uint8_t i =0; i< (sizeof(OTA_client_info.zigbee_ota_ctx_nvm)/sizeof(uint32_t));i++)
  {
    ee_status = EE_Read(0, USER_DB_START_ADDR+i, p_data+i);
    if (ee_status != EE_OK )
    {
      APP_DBG("[OTA] ctx_load : Can't find previous OTA ctx file version in NVM !");
      status = false;
      return status;
    }
  }
  APP_DBG("[OTA] ctx_load : successfully loaded previous OTA ctx from NVM");
  OTA_client_info.flags |= OTA_CLIENT_CTX_FOUND_FLAG;
  OTA_client_info.write_info.flash_current_offset = OTA_client_info.zigbee_ota_ctx_nvm.flash_offset;
  HAL_FLASH_Lock();
  return status;

}

/**
 * @brief  Load persistent data
 * @param  None
 * @retval true if success, false if fail
 */
static bool APP_ZIGBEE_persist_load(void)
{
#ifdef CFG_NVM
    APP_DBG("Retrieving persistent data from FLASH");
    if ( APP_ZIGBEE_NVM_Read() == false )
    {
      return false;
    }
#else /* CFG_NVM */
    /* Check length range */
    if ((cache_persistent_data.U32_data[0] == 0) ||
        (cache_persistent_data.U32_data[0] > ST_PERSIST_MAX_ALLOC_SZ))
    {
        APP_DBG("No data or too large length : %d",cache_persistent_data.U32_data[0]);
        return false;
    }
#endif /* CFG_NVM */

    /* Verify Tag */
    if ( cache_persistent_data.U32_data[1] != ST_PERSIST_TAG )
    {
      APP_DBG("Bad Verification TAG in RAM : 0x%04X",cache_persistent_data.U32_data[1]);
      return false;
    }

    return true;
} /* APP_ZIGBEE_persist_load */


/**
 * @brief  Save persistent data
 * @param  None
 * @retval true if success , false if fail
 */
static bool APP_ZIGBEE_persist_save(void)
{
    uint32_t len;
#ifdef OTA_DISPLAY_TIMING
    static union cache  szPersistentDataTemp = { 0, };
#endif // OTA_DISPLAY_TIMING

    /* Clear the RAM cache before saving */
    memset(cache_persistent_data.U8_data, 0x00, ST_PERSIST_MAX_ALLOC_BUFFER_SZ);

    /* Call the satck API t get current persistent data */
    len = ZbPersistGet(zigbee_app_info.zb, 0, 0);

    /* Check Length range */
    if (len == 0U)
    {
        /* If the persistence length was zero then no data available. */
        APP_DBG("APP_ZIGBEE_persist_save: no persistence data to save !");
        return false;
    }

    if (len > ST_PERSIST_MAX_ALLOC_SZ)
    {
        /* if persistence length to big to store */
        APP_DBG("APP_ZIGBEE_persist_save: persist size too large for storage (%d)", len);
        return false;
    }

    /* Store in cache the persistent data */
    len = ZbPersistGet(zigbee_app_info.zb, &cache_persistent_data.U8_data[ST_PERSIST_FLASH_DATA_OFFSET], len);

    /* Store in cache the persistent data length */
    cache_persistent_data.U32_data[0] = len;

