stm32-hotspot/Nucleo_WB55RG_Zigbee_OTA_TransferResume/STM32_WPAN/App/app_zigbee.c
    /* Store in cache the persistent verification Tag */
    cache_persistent_data.U32_data[1] = ST_PERSIST_TAG;

#ifdef OTA_DISPLAY_TIMING
    // -- Compare with previous --
    if ( memcmp( szPersistentDataTemp.U8_data, cache_persistent_data.U8_data, ( len + 8 ) ) == 0 )
      { APP_DBG("APP_ZIGBEE_persist_save: This Persistence is same as previous"); }
    memcpy( szPersistentDataTemp.U8_data, cache_persistent_data.U8_data, (len + 8 ) );
#endif // OTA_DISPLAY_TIMING

    zigbee_app_info.persistNumWrites++;
    APP_DBG("APP_ZIGBEE_persist_save: Persistence written in cache RAM (num writes = %d) len=%d",
             zigbee_app_info.persistNumWrites, cache_persistent_data.U32_data[0]);

#ifdef CFG_NVM
    if(!APP_ZIGBEE_NVM_Write())
    {
      return false;
    }
    APP_DBG("APP_ZIGBEE_persist_save: Persistent data FLASHED");
#endif /* CFG_NVM */

    return true;
} /* APP_ZIGBEE_persist_save */


/**
 * @brief  Delete persistent data
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_persist_delete(void)
{
  /* Clear RAM cache */
  memset(cache_persistent_data.U8_data, 0x00, ST_PERSIST_MAX_ALLOC_BUFFER_SZ);
  APP_DBG("Persistent Data RAM cache cleared");
#ifdef CFG_NVM
  APP_DBG("FLASH ERASED");
  APP_ZIGBEE_NVM_Erase();
#endif /* CFG_NVM */

  // -- Reset Chip --
  *(uint8_t*)SRAM1_BASE = CFG_REBOOT_ON_OTA_FW;
  NVIC_SystemReset();
} /* APP_ZIGBEE_persist_delete */


#ifdef CFG_NVM

/**
 * @brief  Init the NVM
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NVM_Init(void)
{
  int eeprom_init_status;

  APP_DBG("Flash starting address = %x",HW_FLASH_ADDRESS  + CFG_NVM_BASE_ADDRESS);
  eeprom_init_status = EE_Init( 0 , HW_FLASH_ADDRESS + CFG_NVM_BASE_ADDRESS );

  if (eeprom_init_status != EE_OK)
  {
    /* format NVM since init failed */
    eeprom_init_status= EE_Init( 1, HW_FLASH_ADDRESS + CFG_NVM_BASE_ADDRESS );
  }
  APP_DBG("EE_init status = %d",eeprom_init_status);

} /* APP_ZIGBEE_NVM_Init */

/**
*@brief  Read the persistent data from NVM
* @param  None
* @retval true if success , false if failed
*/
static bool APP_ZIGBEE_NVM_Read(void)
{
  uint16_t  num_words;
  uint16_t  num_bytes;
  uint16_t  iIndex;
  bool      status = true;
  int       ee_status = 0;

  HAL_FLASH_Unlock();
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_PGSERR | FLASH_FLAG_WRPERR | FLASH_FLAG_OPTVERR);

  /* Read the data length from cache */
  ee_status = EE_Read(0, ZIGBEE_DB_START_ADDR, &cache_persistent_data.U32_data[0]);
  if (ee_status != EE_OK)
  {
    APP_DBG("Read -> persistent data length not found ERASE to be done - Read Stopped");
    status = false;
  }
  else
  {
    /* Check length is not too big nor zero */
    num_bytes = cache_persistent_data.U32_data[0];
    if ( ( num_bytes == 0 ) || ( num_bytes > ST_PERSIST_MAX_ALLOC_SZ ) )
    {
      APP_DBG("No data or too large length : %d", num_bytes);
      status = false;
    }
    else
    {
      /* Length is within range. Adjust the length to be U32 aligned */
      num_words = (uint16_t) ( num_bytes / 4 ) ;
      if ( cache_persistent_data.U32_data[0] % 4 != 0 )
      {
        num_words++;
      }
      // -- Add the Verification Tag  --
      num_words++;

      /* copy the read data from Flash to cache including length */
      for ( iIndex = 1; iIndex <= num_words; iIndex++)
      {
        /* read data from first data in U32 unit */
        ee_status = EE_Read(0, iIndex + ZIGBEE_DB_START_ADDR, &cache_persistent_data.U32_data[iIndex] );
        if (ee_status != EE_OK)
        {
          APP_DBG("Read not found leaving");
          status = false;
          break;
        }
      }
    }
  }

  HAL_FLASH_Lock();
  if(status)
  {
    APP_DBG("READ PERSISTENT DATA LEN = %d", num_bytes);
  }

  return status;
} /* APP_ZIGBEE_NVM_Read */


/**
 * @brief  Write the persistent data in NVM
 * @param  None
 * @retval None
 */
static bool APP_ZIGBEE_NVM_Write(void)
{
  int ee_status = 0;
  uint16_t num_words;
  uint16_t iIndex;

  // -- Offset in Word for Length + Tag */
  num_words = ( ST_PERSIST_FLASH_DATA_OFFSET / 4u );
  num_words += (uint16_t) ( cache_persistent_data.U32_data[0] / 4u );

  /* Adjust the length to be U32 aligned */
  if ( cache_persistent_data.U32_data[0] % 4 != 0 )
  {
    num_words++;
  }

  // -- Save data in flash --
  for ( iIndex = 0; iIndex < num_words; iIndex++ )
  {
    ee_status = EE_Write(0, (uint16_t)iIndex + ZIGBEE_DB_START_ADDR, cache_persistent_data.U32_data[iIndex]);
    if (ee_status != EE_OK)
    {
      if (ee_status == EE_CLEAN_NEEDED) /* Shall not be there if CFG_EE_AUTO_CLEAN = 1*/
      {
        APP_DBG("CLEAN NEEDED, CLEANING");
        EE_Clean(0,0);
      }
      else
      {
        /* Failed to write , an Erase shall be done */
        APP_DBG("APP_ZIGBEE_NVM_Write failed @ %d status %d", iIndex, ee_status);
        break;
      }
    }
  }

  if(ee_status != EE_OK)
  {
     APP_DBG("WRITE STOPPED, need a FLASH ERASE");
     return false;
  }

  APP_DBG("WRITTEN PERSISTENT DATA LEN = %d", cache_persistent_data.U32_data[0]);
  return true;
} /* APP_ZIGBEE_NVM_Write */


/**
 * @brief  Erase the NVM
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NVM_Erase(void)
{
   EE_Init(1, HW_FLASH_ADDRESS + CFG_NVM_BASE_ADDRESS + ZIGBEE_DB_START_ADDR); /* Erase Flash except user data */
} /* APP_ZIGBEE_NVM_Erase */

#endif /* CFG_NVM */


/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_App_Init(void){
  /* Tasks associated to OTA upgrade process */
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_ZIGBEE_OTA_REQUEST_UPGRADE, UTIL_SEQ_RFU, APP_ZIGBEE_OTA_Client_Request_Upgrade);
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_ZIGBEE_OTA_START_DOWNLOAD, UTIL_SEQ_RFU, APP_ZIGBEE_OTA_Client_StartDownload);
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_ZIGBEE_OTA_RESUME_DOWNLOAD, UTIL_SEQ_RFU, APP_ZIGBEE_OTA_Client_ResumeDownload);
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_ZIGBEE_OTA_SERVER_DISCOVERY, UTIL_SEQ_RFU, APP_ZIGBEE_OTA_Client_ServerDiscovery);
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_FUOTA_RESET, UTIL_SEQ_RFU, APP_ZIGBEE_PerformReset);

  /* Timer associated to GREEN LED toggling */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &TS_ID_LED, hw_ts_Repeated, APP_ZIGBEE_LEDToggle);

